[
  {
    "Model": "Intel Core i9-13900K",
    "Cores": 24,
    "BaseClock": "3.0 GHz",
    "BoostClock": "5.8 GHz",
    "Description": "Флагманський процесор із архітектурою Raptor Lake. Має 24 ядра (8 продуктивних і 16 енергоефективних) і 32 потоки. Енергоспоживання становить 125W. Підтримує DDR5 і PCIe 5.0, забезпечуючи високу продуктивність для ентузіастів."
  },
  {
    "Model": "AMD Ryzen 9 7950X",
    "Cores": 16,
    "BaseClock": "4.5 GHz",
    "BoostClock": "5.7 GHz",
    "Description": "Потужний процесор із архітектурою Zen 4. Оснащений 16 ядрами та 32 потоками. Має енергоспоживання 170W. Ідеальний вибір для творчих завдань та геймінгу, з підтримкою DDR5 і PCIe 5.0."
  },
  {
    "Model": "Intel Core i5-13600K",
    "Cores": 14,
    "BaseClock": "3.5 GHz",
    "BoostClock": "5.1 GHz",
    "Description": "Середньорівневий процесор на базі архітектури Raptor Lake. Оснащений 14 ядрами (6 продуктивних і 8 енергоефективних) і 20 потоками. Енергоспоживання складає 125W. Чудове співвідношення ціни та продуктивності для геймінгу."
  },
  {
    "Model": "AMD Ryzen 7 7700X",
    "Cores": 8,
    "BaseClock": "4.5 GHz",
    "BoostClock": "5.4 GHz",
    "Description": "Процесор із архітектурою Zen 4. Має 8 ядер і 16 потоків. Енергоспоживання становить 105W. Ідеально підходить для ігор і задач, що вимагають високої тактової частоти."
  },
  {
    "Model": "Intel Core i3-13100",
    "Cores": 4,
    "BaseClock": "3.4 GHz",
    "BoostClock": "4.5 GHz",
    "Description": "Доступний процесор на базі архітектури Raptor Lake. Оснащений 4 ядрами і 8 потоками. Енергоспоживання складає 60W. Ідеально підходить для офісних завдань і базового геймінгу."
  },
  {
    "Model": "AMD Ryzen 5 7600X",
    "Cores": 6,
    "BaseClock": "4.7 GHz",
    "BoostClock": "5.3 GHz",
    "Description": "Шестиядерний процесор із архітектурою Zen 4. Має 12 потоків і енергоспоживання 105W. Забезпечує збалансовану продуктивність для ігор і повсякденних задач."
  },
  {
    "Model": "Intel Core i7-13700K",
    "Cores": 16,
    "BaseClock": "3.4 GHz",
    "BoostClock": "5.4 GHz",
    "Description": "Процесор на базі архітектури Raptor Lake із 16 ядрами (8 продуктивних і 8 енергоефективних) і 24 потоками. Енергоспоживання становить 125W. Чудовий вибір для геймерів і творчих професіоналів."
  },
  {
    "Model": "AMD Ryzen 9 5900X",
    "Cores": 12,
    "BaseClock": "3.7 GHz",
    "BoostClock": "4.8 GHz",
    "Description": "Процесор із архітектурою Zen 3. Має 12 ядер і 24 потоки. Енергоспоживання складає 105W. Підходить для багатопотокових задач і творчих проектів."
  },
  {
    "Model": "Intel Xeon W-3265",
    "Cores": 24,
    "BaseClock": "2.7 GHz",
    "BoostClock": "4.4 GHz",
    "Description": "Серверний процесор із архітектурою Cascade Lake. Оснащений 24 ядрами і 48 потоками. Енергоспоживання становить 205W. Розроблений для професійних задач і робочих станцій."
  },
  {
    "Model": "Apple M2 Max",
    "Cores": 12,
    "BaseClock": "N/A",
    "BoostClock": "N/A",
    "Description": "ARM-процесор із архітектурою Apple Silicon. Оснащений 12 ядрами (8 продуктивних і 4 енергоефективних). Енергоспоживання становить лише 35W. Ідеальний для роботи на MacBook Pro завдяки високій енергоефективності."
  }
]